#include <sp.h>
#include "common.h"
#include "sys/om.h"
#include "sys/gtl.h"
#include "sys/vi.h"
#include "sys/mtx.h"

#define gSPMvpRecalc(pkt) gImmp21((pkt), G_SPECIAL_1, 0, 1, 0)
#define gsSPMvpRecalc() gsImmp21(G_SPECIAL_1, 0, 1, 0)
#define G_TX_TILE_5 (5)
#define G_TX_TILE_BLOCK (6)

typedef struct DObjUnk50_3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ Gfx* unk_04;
} DObjUnk50_3; // size = 0x08

typedef struct DObjUnk50_5 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ DObjUnk50_3* unk_04;
} DObjUnk50_5; // size = 0x08

typedef struct DObjUnk50_4 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ Gfx* unk_04;
} DObjUnk50_4; // size = 0x08

typedef struct DObjUnk50_1 {
    /* 0x00 */ Gfx* unk_00;
    /* 0x04 */ Gfx* unk_04;
} DObjUnk50_1; // size = 0x08

typedef struct DObjUnk50_2 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ Gfx* unk_04;
    /* 0x08 */ Gfx* unk_08;
} DObjUnk50_2; // size = 0x0C

// data
s32 D_80040F30 = 0;
s32 D_80040F34 = 0;
s32 D_80040F38 = 0;
s32 D_80040F3C = 0;

// bss
Mtx* sProjectionMatrix;
f32 sScaleX;
Mtx4f sPerspectiveMatrixF;
Mtx4f sMvpMatrixF;
Mtx4f _D_8004AFA8;
Mtx4f _D_8004AFE8;
s32 _D_8004B028;
f32 sScaleY;
f32 sScaleZ;
s32 sIsScaleMtxPushed;
Struct_8004B038* sCustomMatrixHandler;
Gfx* _D_8004B03C;
Gfx* _D_8004B040[4];
Gfx _D_8004B050[60];
s32 sLevelOfDetail;
Gfx* _D_8004B238[4];
Gfx* _D_8004B248;

void func_80011230(s32 arg0, s32 arg1, s32 arg2, s32 arg3) {
    D_80040F30 = arg0;
    D_80040F34 = arg1;
    D_80040F38 = arg2;
    D_80040F3C = arg3;
}

void func_80011254(Struct_8004B038* arg0) {
    sCustomMatrixHandler = arg0;
}

void func_80011260(void) {
}

void func_80011268(Mtx* arg0, DObj* arg1, s32 arg2) {
    Mtx4f sp48;
    f32 x, y, z;

    OMCamera* cam;
    f32 res;

    cam = omCurrentCamera->data.cam;
    x = arg1->position.v.x - cam->viewMtx.lookAt.eye.x;
