#include "common_structs.h"
#include "app_render.h"

#include "beach/beach.h"
#if !defined(M2CTX) && !defined(PERMUTER)
#include "ld_addrs.h"
#include "string.h"
#endif
#include "world/world.h"

s32 func_8009FCC0(void);
void func_800AB050(f32 arg0, s32 arg1, UNK_TYPE* arg2, UNK_TYPE* arg3, UNK_TYPE* arg4);
s32 func_80364494_5048A4(UnkRustRat* arg0, f32* arg1, f32* arg2, f32* arg3, f32* arg4);

typedef struct Unk8009C604 {
    /* 0x00 */ UnkRustRat* unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
} Unk8009C604; // size = 0xC

typedef struct Unk1C {
    /* 0x00 */ u32 id;
    /* 0x04 */ f32 scale;
    /* 0x08 */ UnkEC64Arg3* unk_8;
    /* 0x0C */ Texture*** unk_C;
    /* 0x10 */ void (*unk_10)(GObj*);
    /* 0x14 */ AnimCmd** unk_14;
    /* 0x18 */ AnimCmd*** unk_18;
} Unk1C; // size = 0x1C

typedef struct UnkV0 {
    u32 unk_00;
    f32 unk_04;
    UnkEC64Arg3* unk_08;
    Texture*** unk_0C;
    void (*unk_10)(GObj*);
} UnkV0; // substruct of Unk1C?

typedef struct Unkfunc_8009BDDCSub {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ AnimCmd** modelAnims;
    /* 0x08 */ AnimCmd*** matAnims;
} Unkfunc_8009BDDCSub; // size = 0xC

typedef struct Unkfunc_8009BDDC {
    /* 0x00 */ u32 pokemonID;
    /* 0x04 */ Unkfunc_8009BDDCSub* unk_04;
    /* 0x08 */ s32 unk_08; // number of unk_04 records?
} Unkfunc_8009BDDC;        // size = 0xC

typedef struct Struct_800ACD9C {
    /* 0x00 */ UNK_TYPE* unk_00;
    /* 0x04 */ char unk_04[8];
} Struct_800ACD9C; // size = 0xC

extern s32 D_800AC0F0; // level id?
extern MovementState D_800AC0F4;
extern Struct_800ACD9C D_800ACD9C[];
extern Struct_800ACD9C D_800AD444[];
extern Struct_800ACD9C D_800AD474[];
extern Unkfunc_8009BDDC D_800AD4B8[67];
extern Unkfunc_8009BDDC D_800AD9A4[16];
extern Unk1C D_800ADA64[];
extern UnkV0 D_800ADBEC[];
extern s32 D_800AE27C;
extern s32 D_800AE280;
extern char* D_800AE284[]; // Pokedex entries
extern s8 D_800AE4E4[];

// s8 D_800AE4E4[] = {
//     0,  -1, -1, 1,  2,  3,  4,  -1, -1, -1, 5,  6,  -1, 7,  -1, 8,  -1, -1, -1, -1, -1, -1, -1, -1, 9,  -1,
//     10, 11, -1, -1, -1, -1, -1, -1, -1, -1, 12, -1, 13, -1, 14, -1, -1, -1, 15, -1, -1, -1, -1, 16, 17, 18,
//     -1, 19, -1, 20, -1, 21, 22, 23, -1, -1, -1, -1, -1, -1, -1, -1, -1, 24, 25, -1, -1, 26, 27, -1, -1, 28,
//     29, 30, 31, 32, -1, 33, -1, -1, -1, 34, 35, 36, 37, -1, 38, -1, -1, -1, -1, -1, -1, -1, 39, -1, -1, -1,
