#include "app_render.h"

typedef struct UnkAsphaltLeopard {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ Vec3f unk_14;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ u8 unk_30[1]; // variable length
} UnkAsphaltLeopard;

typedef struct UnkPinkLeopard {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ u32 unk_18[1]; // variable length
} UnkPinkLeopard;

typedef struct UnkGreenLeopard {
    /* 0x00 */ s32 unk_00[7];
    /* 0x1C */ Vec3f unk_1C;
} UnkGreenLeopard;

typedef struct Unk_800A7114 {
    /* 0x00 */ char unk_00[4];
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ char unk_06[2];
    /* 0x08 */ u8 unk_08;
    /* 0x09 */ u8 unk_09;
} Unk_800A7114; // size >= 0xC

extern u8 D_800AEC60;
extern u8 D_800AEC64;
extern u16 D_800AEC68;

extern UnkRustRat* D_800BE1A0;
extern UnkRustRat* D_800BE1A8[16];
extern UnkPinkRat* D_800BE1E8;
extern UnkPinkRat* D_800BE1EC;
extern OMCamera* D_800BE1F0[4];
extern u8 D_800BE200[4];
extern UnkGreenLeopard* D_800BE204[9];
extern UnkAsphaltLeopard** D_800BE268[];
extern UnkPinkLeopard** D_800BE288[];
extern void (*D_800BE2A8)(UnkPinkRat*, Vec3f*);
extern void (*D_800BE2AC)(UnkPinkRat*);
extern UnkPinkRat* D_800BE2B0;

void func_800A4798(GObj*);
void func_800A4858(GObj*);
void func_800A63BC(GObj*);

void func_800A1ED0(s32 arg0, s32* arg1, s32* arg2) {
    s32 i, j;

    if (arg0 >= 8) {
        return;
    }

    D_800BE228[arg0] = *arg1;
    D_800BE248[arg0] = *arg2;
    D_800BE268[arg0] = (UnkAsphaltLeopard**) (arg1 + 1);
    D_800BE288[arg0] = (UnkPinkLeopard**) (arg2 + 1);

    for (i = 1; i <= D_800BE228[arg0]; i++) {
