#include "common.h"
#include "world/world.h"

#define GET_ITEM(x) ((UnkPesterBall2*)((x)->userData))

typedef struct UnkPesterBall2 {
    /* 0x00 */ u8 itemID;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ Vec3f velocity;
    /* 0x14 */ Vec3f unk_14;
    /* 0x20 */ Vec3f unk_20;
} UnkPesterBall2;

typedef struct UnkTangyViper {
    /* 0x00 */ struct UnkTangyViper* unk_00;
    /* 0x04 */ struct UnkTangyViper* unk_04;
    /* 0x08 */ GObj* unk_08;
    /* 0x0C */ s32 unk_0C;
} UnkTangyViper; // size = 0x10

extern Texture** D_800E8EB8[];
extern UnkEC64Arg3 D_800E9138[];
extern AnimCmd** D_800E91C0[];

extern Texture** D_800EAC58[];
extern UnkEC64Arg3 D_800EAED0[];
extern AnimCmd** D_800EAF60[];

extern AnimCmd* D_800EAFB0[];
extern AnimCmd** D_800EB0C0[];
extern Texture** D_800EB510[];

extern AnimCmd* D_800ED5B0[];
extern AnimCmd** D_800ED6B0[];
extern UnkEC64Arg3 D_800EDAB0[];
extern Texture** D_800EDB90[];

extern UnkTangyViper D_803AEF68_54F378[20];
extern UnkTangyViper* D_803AF0AC_54F4BC;
extern UnkTangyViper* D_803AF0B0_54F4C0;
extern f32 D_80382C1C_52302C;
extern f32 D_80382C20_523030;
extern f32 D_80382C24_523034;
extern s32 D_803AF0BC_54F4CC;
extern s32 D_803AF0C0_54F4D0;
extern s32 D_803AF0C4_54F4D4;
extern UnkTangyViper* D_803AF0A8_54F4B8;
extern Vec3f D_8038A398_52A7A8;
extern u8 D_803AF0C8_54F4D8;
extern GObjFunc D_80382EB4_5232C4;
extern s32 D_803AF0B4_54F4C4;
extern s32 D_803AF0B8_54F4C8;
