#include "common.h"
#include "world/world.h"
#include "app_level.h"

extern DObj* gPlayerDObj;
extern GObj* gPokemonInFocus;

extern Vec3f D_8038A430_52A840;

void deletePokemon(GObj* pokemonObj);
void func_800A716C(GObj*);
u8 getIsPaused(void);
void func_80366864_506C74(GObj*, s32);
void func_803667C0_506BD0(GObj*, UNK_TYPE, UNK_TYPE);
s32 func_8036381C_503C2C(void);
s32 func_80360E78_501288(GObj* arg0, f32 arg1, s32 arg2);

typedef struct SomeListEntry {
    /* 0x00 */ struct SomeListEntry* prev;
    /* 0x04 */ struct SomeListEntry* next;
    /* 0x08 */ GObj* obj;
} SomeListEntry; // size ?

typedef struct UnkHeatherLynx {
    /* 0x00 */ struct UnkHeatherLynx* next;
    /* 0x04 */ PokemonTransformBase* unk_04;
} UnkHeatherLynx; // size 0x8

typedef struct UnkHeatherLynx2 {
    /* 0x00 */ struct UnkHeatherLynx2* next;
    /* 0x04 */ Pokemon* unk_04;
} UnkHeatherLynx2; // size 0x8

typedef struct UnkHeatherLynx3 {
    /* 0x00 */ struct UnkHeatherLynx3* next;
    /* 0x04 */ Item* unk_04;
} UnkHeatherLynx3; // size 0x8

extern SomeListEntry* D_803B0C08_551018;
extern SomeListEntry* D_803B0C0C_55101C;
extern SomeListEntry* D_803B0C10_551020;
extern UnkHeatherLynx D_803B0C18_551028[40];
extern UnkHeatherLynx* D_803B0D58_551168;
extern UnkHeatherLynx* D_803B0D5C_55116C;
extern UnkHeatherLynx2 D_803B0D60_551170[40];
extern UnkHeatherLynx2* D_803B0EA0_5512B0;
extern UnkHeatherLynx2* D_803B0EA4_5512B4;
extern UnkHeatherLynx3 D_803B0EA8_5512B8[20];
extern UnkHeatherLynx3* D_803B0F48_551358;
extern UnkHeatherLynx3* D_803B0F4C_55135C;

void func_8035E780_4FEB90(GObj* arg0) {
    SomeListEntry* temp_v1 = D_803B0C10_551020;

    if (D_803B0C10_551020 == NULL) {
        return;
    }
        
    D_803B0C10_551020 = D_803B0C10_551020->next;

    temp_v1->prev = D_803B0C0C_55101C;
    temp_v1->next = 0;
    
    if (temp_v1->prev != NULL) {
        temp_v1->prev->next = D_803B0C0C_55101C = temp_v1;
    } else {
