#include "common.h"
#include "world/world.h"
#include "app_level.h"

typedef struct PokemonObjectListEntry {
    /* 0x00 */ struct PokemonObjectListEntry* prev;
    /* 0x04 */ struct PokemonObjectListEntry* next;
    /* 0x08 */ GObj* obj;
} PokemonObjectListEntry; // size 0xC

typedef struct PokemonTransformListEntry {
    /* 0x00 */ struct PokemonTransformListEntry* next;
    /* 0x04 */ PokemonTransformBase* transform;
} PokemonTransformListEntry; // size 0x8

typedef struct PokemonDataListEntry {
    /* 0x00 */ struct PokemonDataListEntry* next;
    /* 0x04 */ Pokemon* pokemon;
} PokemonDataListEntry; // size 0x8

typedef struct ItemListEntry {
    /* 0x00 */ struct ItemListEntry* next;
    /* 0x04 */ Item* item;
} ItemListEntry; // size 0x8

Gfx D_8038A3D0_52A7E0[] = {
    gsDPPipeSync(),
    gsSPFogPosition(968, 990),
    gsDPSetCycleType(G_CYC_2CYCLE),
    gsDPSetRenderMode(Z_CMP | IM_RD | CVG_DST_FULL | ZMODE_XLU | FORCE_BL | G_RM_FOG_SHADE_A, Z_CMP | IM_RD | CVG_DST_FULL | ZMODE_XLU | FORCE_BL | GBL_c2(G_BL_CLR_IN, G_BL_A_FOG, G_BL_CLR_MEM, G_BL_1MA)),
    gsSPSetGeometryMode(G_FOG),
    gsSPEndDisplayList(),
};
Gfx D_8038A400_52A810[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_1CYCLE),
    gsDPSetRenderMode(G_RM_AA_ZB_OPA_SURF, G_RM_AA_ZB_OPA_SURF2),
    gsSPClearGeometryMode(G_FOG),
    gsDPSetCombineMode(G_CC_MODULATEIDECALA, G_CC_PASS2),
    gsSPEndDisplayList(),
};

extern DObj* gPlayerDObj;
extern GObj* gPokemonInFocus;

void pokemonChangeBlockOnGround(GObj* arg0, f32 arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6);
void func_800A5E98(Vec3f*, Vec3f*, DObj*);
void func_800AB1F8(EggStruct*);
s32 func_800AB138(EggStruct* arg0, f32 arg1);
